[
  {
    "quote": "One is not born, but rather becomes, a woman.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "One is not born a genius, one becomes a genius.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "I tore myself away from the safe comfort of certainties through my love for truth - and truth rewarded me.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "If you live long enough, you'll see that every victory turns into a defeat.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "Change your life today. Don't gamble on the future, act now, without delay.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "All oppression creates a state of war.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "One's life has value so long as one attributes value to the life of others, by means of love, friendship, indignation and compassion.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "Retirement may be looked upon either as a prolonged holiday or as a rejection, a being thrown on to the scrap-heap.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "Man is defined as a human being and a woman as a female - whenever she behaves as a human being she is said to imitate the male.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "Sex pleasure in woman, as I have said, is a kind of magic spell; it demands complete abandon; if words or movements oppose the magic of caresses, the spell is broken.",
    "author": "Simone De Beauvoir"
  },
  {
    "quote": "The struggle itself towards the heights is enough to fill a man's heart. One must imagine Sisyphus happy.",
    "author": "Albert Camus"
  }, {
    "quote": "In the depth of winter, I finally learned that within me there lay an invincible summer.",
    "author": "Albert Camus"
  }, {
    "quote": "There is but one truly serious philosophical problem and that is suicide.",
    "author": "Albert Camus"
  }, {
    "quote": "Don't walk behind me; I may not lead. Don't walk in front of me; I may not follow. Just walk beside me and be my friend.",
    "author": "Albert Camus"
  }, {
    "quote": "The only way to deal with an unfree world is to become so absolutely free that your very existence is an act of rebellion.",
    "author": "Albert Camus"
  }, {
    "quote": "Freedom is nothing but a chance to be better.",
    "author": "Albert Camus"
  }, {
    "quote": "Life is the sum of all your choices.",
    "author": "Albert Camus"
  }, {
    "quote": "I rebel; therefore I exist.",
    "author": "Albert Camus"
  }, {
    "quote": "Autumn is a second spring when every leaf is a flower.",
    "author": "Albert Camus"
  }, {
    "quote": "But in the end one needs more courage to live than to kill himself.",
    "author": "Albert Camus"
  },
  {
    "quote": "Man is condemned to be free; because once thrown into the world, he is responsible for everything he does.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Life begins on the other side of despair.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "It is only in our decisions that we are important.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Life has no meaning the moment you lose the illusion of being eternal.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "When the rich wage war it's the poor who die.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "If you are lonely when you are alone, you are in bad company.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Freedom is what you do with what's been done to you.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Commitment is an act, not a word.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Everything has been figured out, except how to live.",
    "author": "Jean-Paul Sartre"
  }, {
    "quote": "Every existing thing is born without reason, prolongs itself out of weakness, and dies by chance.",
    "author": "Jean-Paul Sartre"
  }
]
